### Terraform
<details>
<summary>terraform plan: success</summary>

    Acquiring state lock. This may take a few moments...
    module.domain_rip_tie.cloudflare_zone.root: Refreshing state... [id=32eb19856ba3ad43eeb7e17e08e03fc7]
    module.domain_wtf_tie.cloudflare_zone.root: Refreshing state... [id=85952fa62599574341abdae573e0f069]
    
    Note: Objects have changed outside of Terraform
    
    Terraform detected the following changes made outside of Terraform since the
    last "terraform apply":
    
      # module.domain_wtf_tie.cloudflare_zone.root has been changed
      ~ resource "cloudflare_zone" "root" {
            id                  = "85952fa62599574341abdae573e0f069"
          ~ status              = "pending" -> "active"
            # (7 unchanged attributes hidden)
        }
      # module.domain_rip_tie.cloudflare_zone.root has been changed
      ~ resource "cloudflare_zone" "root" {
            id                  = "32eb19856ba3ad43eeb7e17e08e03fc7"
          ~ status              = "pending" -> "active"
            # (7 unchanged attributes hidden)
        }
    
    Unless you have made equivalent changes to your configuration, or ignored the
    relevant attributes using ignore_changes, the following plan may include
    actions to undo or respond to these changes.
    
    ─────────────────────────────────────────────────────────────────────────────
    
    Terraform used the selected providers to generate the following execution
    plan. Resource actions are indicated with the following symbols:
      + create
      - destroy
    
    Terraform will perform the following actions:
    
      # module.domain_rip_tie.cloudflare_record.madara_aaaa1 will be created
      + resource "cloudflare_record" "madara_aaaa1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "madara"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "AAAA"
          + value       = "2a02:2168:8fec:f600::942"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.roku_a1 will be created
      + resource "cloudflare_record" "roku_a1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "roku"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "A"
          + value       = "95.84.246.62"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.roku_aaaa1 will be created
      + resource "cloudflare_record" "roku_aaaa1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "roku"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "AAAA"
          + value       = "2a02:2168:8fec:f600::1"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.roku_aaaa2 will be created
      + resource "cloudflare_record" "roku_aaaa2" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "roku"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "AAAA"
          + value       = "2a02:2168:a0f:a2a3::3"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.saitama_a1 will be created
      + resource "cloudflare_record" "saitama_a1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "saitama"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "A"
          + value       = "188.255.3.141"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.saitama_aaaa1 will be created
      + resource "cloudflare_record" "saitama_aaaa1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "saitama"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "AAAA"
          + value       = "2a02:2168:8fec:f600::39f"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.tatsuya_a1 will be created
      + resource "cloudflare_record" "tatsuya_a1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "tatsuya"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "A"
          + value       = "37.110.66.21"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.tatsuya_aaaa1 will be created
      + resource "cloudflare_record" "tatsuya_aaaa1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "tatsuya"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "AAAA"
          + value       = "2a02:2168:8fec:f600::39f"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.ubernet_a1 will be created
      + resource "cloudflare_record" "ubernet_a1" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "ubernet"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "A"
          + value       = "188.32.206.130"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_record.ubernet_aaaa2 will be created
      + resource "cloudflare_record" "ubernet_aaaa2" {
          + created_on  = (known after apply)
          + hostname    = (known after apply)
          + id          = (known after apply)
          + metadata    = (known after apply)
          + modified_on = (known after apply)
          + name        = "ubernet"
          + proxiable   = (known after apply)
          + ttl         = (known after apply)
          + type        = "AAAA"
          + value       = "2a02:2168:a0f:a2a3::4"
          + zone_id     = (known after apply)
        }
    
      # module.domain_rip_tie.cloudflare_zone.default will be created
      + resource "cloudflare_zone" "default" {
          + id                  = (known after apply)
          + meta                = (known after apply)
          + name_servers        = (known after apply)
          + plan                = (known after apply)
          + status              = (known after apply)
          + type                = "full"
          + vanity_name_servers = (known after apply)
          + verification_key    = (known after apply)
          + zone                = "tie.rip"
        }
    
      # module.domain_rip_tie.cloudflare_zone.root will be destroyed
      - resource "cloudflare_zone" "root" {
          - id                  = "32eb19856ba3ad43eeb7e17e08e03fc7" -> null
          - meta                = {
              - "phishing_detected"  = "false"
              - "wildcard_proxiable" = "false"
            } -> null
          - name_servers        = [
              - "joyce.ns.cloudflare.com",
              - "luke.ns.cloudflare.com",
            ] -> null
          - paused              = false -> null
          - plan                = "free" -> null
          - status              = "active" -> null
          - type                = "full" -> null
          - vanity_name_servers = [] -> null
          - zone                = "tie.rip" -> null
        }
    
      # module.domain_wtf_tie.cloudflare_zone.default will be created
      + resource "cloudflare_zone" "default" {
          + id                  = (known after apply)
          + meta                = (known after apply)
          + name_servers        = (known after apply)
          + plan                = (known after apply)
          + status              = (known after apply)
          + type                = "full"
          + vanity_name_servers = (known after apply)
          + verification_key    = (known after apply)
          + zone                = "tie.wtf"
        }
    
      # module.domain_wtf_tie.cloudflare_zone.root will be destroyed
      - resource "cloudflare_zone" "root" {
          - id                  = "85952fa62599574341abdae573e0f069" -> null
          - meta                = {
              - "phishing_detected"  = "false"
              - "wildcard_proxiable" = "false"
            } -> null
          - name_servers        = [
              - "joyce.ns.cloudflare.com",
              - "luke.ns.cloudflare.com",
            ] -> null
          - paused              = false -> null
          - plan                = "free" -> null
          - status              = "active" -> null
          - type                = "full" -> null
          - vanity_name_servers = [] -> null
          - zone                = "tie.wtf" -> null
        }
    
      # module.domain_wtf_tie.cloudflare_zone_settings_override.default will be created
      + resource "cloudflare_zone_settings_override" "default" {
          + id                       = (known after apply)
          + initial_settings         = (known after apply)
          + initial_settings_read_at = (known after apply)
          + readonly_settings        = (known after apply)
          + zone_id                  = (known after apply)
          + zone_status              = (known after apply)
          + zone_type                = (known after apply)
    
          + settings {
              + always_online               = (known after apply)
              + always_use_https            = (known after apply)
              + automatic_https_rewrites    = (known after apply)
              + brotli                      = (known after apply)
              + browser_cache_ttl           = (known after apply)
              + browser_check               = (known after apply)
              + cache_level                 = (known after apply)
              + challenge_ttl               = (known after apply)
              + cname_flattening            = "flatten_all"
              + development_mode            = (known after apply)
              + email_obfuscation           = (known after apply)
              + h2_prioritization           = (known after apply)
              + hotlink_protection          = (known after apply)
              + http2                       = (known after apply)
              + http3                       = (known after apply)
              + image_resizing              = (known after apply)
              + ip_geolocation              = (known after apply)
              + ipv6                        = (known after apply)
              + max_upload                  = (known after apply)
              + min_tls_version             = (known after apply)
              + mirage                      = (known after apply)
              + opportunistic_encryption    = (known after apply)
              + opportunistic_onion         = (known after apply)
              + origin_error_page_pass_thru = (known after apply)
              + polish                      = (known after apply)
              + prefetch_preload            = (known after apply)
              + privacy_pass                = (known after apply)
              + pseudo_ipv4                 = (known after apply)
              + response_buffering          = (known after apply)
              + rocket_loader               = (known after apply)
              + security_level              = (known after apply)
              + server_side_exclude         = (known after apply)
              + sort_query_string_for_cache = (known after apply)
              + ssl                         = "strict"
              + tls_1_2_only                = (known after apply)
              + tls_1_3                     = (known after apply)
              + tls_client_auth             = (known after apply)
              + true_client_ip_header       = (known after apply)
              + universal_ssl               = (known after apply)
              + waf                         = (known after apply)
              + webp                        = (known after apply)
              + websockets                  = (known after apply)
              + zero_rtt                    = (known after apply)
    
              + minify {
                  + css  = (known after apply)
                  + html = (known after apply)
                  + js   = (known after apply)
                }
    
              + mobile_redirect {
                  + mobile_subdomain = (known after apply)
                  + status           = (known after apply)
                  + strip_uri        = (known after apply)
                }
    
              + security_header {
                  + enabled            = (known after apply)
                  + include_subdomains = (known after apply)
                  + max_age            = (known after apply)
                  + nosniff            = (known after apply)
                  + preload            = (known after apply)
                }
            }
        }
    
    Plan: 13 to add, 0 to change, 2 to destroy.
    
    ─────────────────────────────────────────────────────────────────────────────
    
    Note: You didn't use the -out option to save this plan, so Terraform can't
    guarantee to take exactly these actions if you run "terraform apply" now.
    
</details>
<!-- Sticky Pull Request Comment -->